use BeautySalon;

INSERT _Roles_ 
		VALUES 
		(1, 'Директор'),
		(2, 'Мастер')

INSERT _ServiceList_ 
		VALUES 
		(1, 'Макияж'),
		(2, 'Массаж'),
		(3, 'Маникюр'),
		(4, 'Женская стрижка')

INSERT _Users_ 
		VALUES 
		(1, 'Дмитрий', 'Березин', 1),
		(2, 'Марина', 'Авдеева', 2),
		(3, 'Светлана', 'Литвинова', 2),
		(4, 'Маргарита', 'Ерохина', 2),
		(5, 'Виолетта', 'Измер', 2),
		(6, 'Арина', 'Гуз', 2),
		(7, 'Ульяна', 'Устинович', 2),
		(8, 'Владислав', 'Корнеев', 2),
		(9, 'Галина', 'Матвеенко', 2),
		(10, 'Юлия', 'Седловская', 2)

INSERT _Masters_ 
		VALUES 
		(1, 2, 2),
		(2, 3, 3),
		(3, 4, 4),
		(4, 1, 5),
		(5, 4, 6),
		(6, 4, 7),
		(7, 1, 8),
		(8, 2, 9),
		(9, 3, 10)

INSERT _PaymentMethod_ 
		VALUES 
		(1, 'Оплата наличными'),
		(2, 'Оплата картой')

INSERT _ClientStatus_ 
		VALUES 
		(1, 'Обычный клиент', 0),
		(2, 'Постоянный клиент', 20),
		(3, 'VIP клиент', 35),
		(4, 'Супер VIP клиент', 50)

INSERT _Clients_ 
		VALUES 
		(1, 'Олег', 'Кузнецов', '+375294887472', 4),
		(2, 'Тамара', 'Когаленок', '+375448935943', 1),
		(3, 'Анна', 'Савицкая', '+375292214271', 2),
		(4, 'Александра', 'Чупикова', '+375295282934', 3),
		(5, 'Вероника', 'Попалова', '+375292215378', 1),
		(6, 'Милана', 'Шибко', '+375333754948', 1),
		(7, 'Анна', 'Маслова', '+375292297304', 1),
		(8, 'Виктор', 'Фирсов', '+375443915349', 2),
		(9, 'Ольга', 'Шапалова', '+375297754948', 1),
		(10, 'Сабрина', 'Иванова', '+375294285339', 1),
		(11, 'Анна', 'Юдина', '+375292134521', 2),
		(12, 'Ульяна', 'Пашкевич', '+375297795341', 1),
		(13, 'Елизавета', 'Толочко', '+375331045682', 1),
		(14, 'Полина', 'Медведева', '+375442224351', 4),
		(15, 'Янина', 'Кондратьева', '+375294325891', 2),
		(16, 'Оксана', 'Макарова', '+375292242224', 2),
		(17, 'Евгения', 'Нагиева', '+375298995483', 1),
		(18, 'Анастасия', 'Островская', '+375293325898', 3),
		(19, 'Татьяна', 'Давыдова', '+375337245232', 1),
		(20, 'Анатолий', 'Демьянов', '+375446610298', 1),
		(21, 'Ярослава', 'Калачева', '+375295392244', 2),
		(22, 'Анна', 'Колесникова', '+375292234358', 4),
		(23, 'Инна', 'Жук', '+375298347763', 1),
		(24, 'Виктория', 'Пугачева', '+375334215479', 1),
		(25, 'Ян', 'Анохин', '+375293624259', 3)

INSERT _Orders_ 
		VALUES 
		(1, '17.02.2022', '82.00', 1, 2, 2, 9),
		(2, '19.01.2022', '87.50', 14, 3, 1, 4),
		(3, '16.03.2022', '64.00', 6, 4, 1, 1),
		(4, '08.05.2022', '154.00', 10, 4, 1, 7),
		(5, '07.09.2022', '59.50', 25, 2, 1, 3),
		(6, '29.08.2022', '94.00', 23, 3, 1, 2),
		(7, '17.02.2022', '42.00', 2, 1, 1, 2),
		(8, '19.01.2022', '87.50', 19, 3, 2, 5),
		(9, '16.03.2022', '54.00', 16, 4, 2, 8),
		(10, '08.05.2022', '154.00', 22, 4, 1, 1),
		(11, '22.12.2021', '102.00', 13, 1, 1, 4),
		(12, '29.08.2022', '124.00', 8, 2, 1, 8)

INSERT _MakeupTypes_ 
		VALUES 
		(1, 'Дневной макияж', 32),
		(2, 'Вечерний макияж', 40),
		(3, 'Свадебный макияж', 75)

INSERT _IntermediateMakeupTypes_ 
		VALUES 
		(12, 1),
		(1, 2),
		(4, 3)

INSERT _ManicureTypes_
		VALUES 
		(1, 'Аппаратный маникюр', 25),
		(2, 'Классический маникюр', 30),
		(3, 'Комбинированный маникюр', 42)

INSERT _IntermediateManicureTypes_ 
		VALUES 
		(3, 1),
		(6, 2),
		(9, 3)

INSERT _MassageTypes_ 
		VALUES 
		(1, 'Классический общий массаж тела', 36),
		(2, 'Массаж шейно-воротниковой зоны и спины', 49),
		(3, 'Антицеллюлитный массаж', 34)

INSERT _IntermediateMassageTypes_ 
		VALUES 
		(7, 1),
		(11, 2),
		(8, 3)

INSERT _WomHaircutsTypes_ 
		VALUES 
		(1, 'Каре', 28),
		(2, 'Каскад', 25),
		(3, 'Лесенка', 20)

INSERT _IntermediateWomHaircutsTypes_ 
		VALUES 
		(5, 1),
		(10, 2),
		(2, 3)

INSERT _UsersHistory_ 
		VALUES 
		(1, 'Макияж'),